<template>
  <div class="common">
    <VPageHeading button>
      Общие советы
      <template v-slot:info>
        <VTipSmall>
          Совет начинающим - начинайте!
        </VTipSmall>
      </template>
    </VPageHeading>
    <div>
      <VP>
        Все таки вы решились привести себя в порядок, будь на то причина плохое
        самочувствие, неудовлетворительное отражение в зеркале или недостаточная
        уверенность в себя, обусловленная лишним весом. И то что вы решились
        прекрасно!
      </VP>
      <VP>
        Но когда есть желание и недостаточно знаний, весь энтузиазм может
        иссякнуть безрезультатно, поэтому создаем порядок в голове, с чего
        начать и чем продолжить.
      </VP>
      <VH3>Питание</VH3>
      <VP>
        Самый важный и основополагающий фактор вашего преображения это питание.
        Без него никуда. Никаких серьезных изменений в зеркале вы не увидите
        если к рациону относится спустя рукава.
      </VP>
      <VP>
        И первое с чего тут необходимо начать, это научиться питаться дробно.
        Это значит что надо приучить себя кушать 4 - 5 раз в день. Не старайтесь
        сразу менять рацион на правильные приему пищи, научитесь в первую
        очередь периодичности питания. Будь то пельмени или беляши, или щи , в
        первую неделю не важно.
      </VP>
      <VP>
        Как только вы приучите себя питаться часто, средними порциями, ваш
        метаболизм начнет работать на вас. Если же у нас два приема пищи и
        порции большие, организм начинает думать , что впереди плохие времена и
        запасает ваш «драгоценный жир» как источник энергии на будущее. И так
        подкожного жира становится все больше.
      </VP>
      <VTipSmall>
        <VP>
          Стараемся соблюдать интервалы приемы пищи, то есть кушаем каждые 2.5 -
          3.5 часа. Без больших перерывов.
        </VP>
      </VTipSmall>

      <VP>
        Частые приемы нормализуют нормальный метаболизм и процессы
        жизнедеятельности, а это очень важно.
      </VP>
      <VP>
        После того, как вы хотя бы неделю питались часто, без больших
        промежутков времени, наступает следующий шаг- изменение продуктов
        питания. Если говорить просто о сложном, стараемся исключить или, на
        первое время, минмизировать вредные составляющие рациона: жирную пищу,
        пищу обработанну жаркой, сладкое, мучное, калорийные
        напитки(высокосахарные соки , лимонады и тд).
      </VP>
      <VP>
        Если вы заядлый сладкоежка и вам очень тяжело отказаться от сладкого,
        временно поменяйте его на фрукты. Но не рекомендуется налегать на
        бананы, это один из самых высокоуглеводных фруктов.
      </VP>
      <VP color="var(--yellow-trans1)">
        Так из чего же строить рацион?
      </VP>
      <VTipSmall>
        <VP>
          Три основные составляющие всего нашего рациона: белки, жиры и
          углеводы. Разберем что из чего брать.
        </VP>
      </VTipSmall>

      <VH3>
        Белки
      </VH3>
      <VP>
        Эта составляющая вашего питания отвечает главным образом за строительную
        функцию, то есть обновление тканей. Он помогает вашему организму
        восстанавливаться после физической деятельности и делает ваши мышы
        подтянутыми и стройными, а это важно. Белок должен присутствовать в
        каждом приеме пищи.
      </VP>
      <VTipSmall>
        <VP>
          Продукты, содержащие большое количество белка: курица, индейка,
          постная говядина, телятина, крольчатина, нежирный (но и не
          обезжиренный) творог, сыр(с ним аккуратней, многие сорта содержат
          немалое количество жира), так же яйца. Одна из этих составляющих
          должна присутствовать в каждом приеме пищи.
        </VP>
      </VTipSmall>

      <VH3>
        Углеводы
      </VH3>
      <VP>
        Углеводы у нас несут, в основном, энергетическую функцию. Они
        обеспечивают вас энергией, который вы пользуетесь в течении дня. Даже
        когда вы спите, организм тратит большое количество энергии на
        обеспечение вашей жизнедеятельности.
      </VP>
      <VP>
        Углеводы обязательно необходимы в вашем рационе , но их избыток
        усваивается в виде подкожного жира, так что их количество необходимо
        контролировать. В основном избыток углеводов у нас идет от чрезмерного
        потребления сладкого, мучного и хлебобулочных изделий. И под словом
        чрезмерное употребление подразумевается не ваш моральный ограничитель, а
        то количество, которое приводит к увеличению жировой прослойки, так что
        иногда даже незначительно количество углеводов приводит к неприятным
        последствиям.
      </VP>

      <VTipSmall>
        <VP>
          Рекомендуется использовать комплексные углеводы, то есть те, которые
          содержат необходимый набор витаминов, минералов, клетчатки и
          поддерживают уровень сахара в крови в нормальным состоянии, без резки
          сачков, которые потом приводят к сильному аппетиту.
        </VP>
      </VTipSmall>
      <VP>
        Комплексные углеводы: макароны твердых сортов пшеници (не
        развариваем!!!), гречка, не разваренный рис в небольшом количестве,
        крупы, бобовые. Если сильно сократить углеводы в рационе, процесс вашего
        похудения сильно затормозится или полностью остановится, во всем важен
        баланс.
      </VP>
      <VH3>Жиры</VH3>
      <VP>
        Жиры выполняют важные функции в нашем организме, от материала для
        образования гормонов, до поддержания нормального состояния вашей кожи,
        ногтей и волос. Их количество должно быть строго определено и не
        превышать необходимого для организма объема. Избыток жиров тоже
        усваивается в подкожный жир.
      </VP>

      <VTipSmall>
        <VP>
          Источники качественных жиров: орехи(миндаль, грецкие, кедровые,
          миндаль), красная рыба, льняное масло и рыбий жир в капсулах.
        </VP>
      </VTipSmall>

      <VH3>Клетчатка</VH3>
      <VP>
        Тут мы затронем вопрос овощей. Овощи не только источник витаминов,
        минералов и важный элемент усвоения белка, но и источник клетчатки.
        Клетчатка- это неперевариваемые углеводы, не имеющие ка таковой
        энергетической ценности, но играющие важную роль в вашем пищеварении.
        Клетчатка является абсорбентом, то есть «чистит» ваш кишечник и
        позволяет усваевать пищу лучше.
      </VP>
      <VTipSmall>
        <VP>
          Источники клетчатки: некоторые крупы, свежие волокнистые
          овощи(большинство из них зеленого цвета), а так же порошек под
          названием «клетчатка», который мы добавляем в пищу.
        </VP>
      </VTipSmall>
      <VH3>
        Итак, подытожим
      </VH3>
      <ul class="list-total">
        <li>Налаживаем периодичность и дробность питания.</li>
        <li>
          В каждом приеме пищи обязательно присутствует белок. Большую часть
          углеводов передвигаем на дневное время, так как в дневное время у нас
          пик активности, это позволит рационально расходовать углеводы.
        </li>
        <li>
          Обязательно используем качественные жиры в своем рационе каждый день.
        </li>
        <li>
          Обязательно используем свежие овощи в приемах пищи. За исключением
          картофеля и с осторожностью (в разумных каличествах) свеклу.
        </li>
        <li>
          Пьем много воды, это очень важный ускоритель ваших обменных процессов.
          Минимальный порог 1.5 литра питьевой воды в день.
        </li>
      </ul>
      <VTipSmall>
        <VP>
          Используя эти несложные правила, ваш рацион в корне поменяется и будет
          верным помощником в ваших целях по преображению.
        </VP>
      </VTipSmall>
      <VH3>Тренировки</VH3>
      <VP>
        Тренировки несут важную роль при похудении. На дефиците калорий организм
        будет не только сжигать подкожный жир, но использовать в виде энергии
        ваши мышци, подвергая их разрушению. Это приведет к «дряблому» внешнему
        виду, ухудшению осанки, слабости и многим другим неприятным
        последствиям.
      </VP>
      <VP>
        Очень важно обеспечить организм соразмерной физической нагрузкой,
        которая будет держать ваши мышцы в тонусе. А так как мышцы – очень
        энергозатратный компонент вашего организма, то они же вам и позволят
        значительно ускорить жиросжигание.
      </VP>
      <VP>
        Обязательно двигайтесь. Пусть это будет прогулки, ходьба по магазинам,
        ходьба по лестнице. Чем больше движения, тем быстрее увидите результат.
        Старайтесь занять себя бытовой активностью, например уборкой, это тоже
        хороший способ расхода калорий.
      </VP>
      <VP>
        Но так же будьте осторожны с физическими нагрузками. Если начать слишком
        интенсивно тренироваться, возможно себя перетрудить или травмироваться.
        А так же может наступить апатия, которая отобьёт все желание трудиться
        над своей фигурой дальше.
      </VP>
      <VTipSmall>
        <VP>
          Ориентируйтесь на свое самочувствие. Приятная усталость будет
          сигнализировать вам о правильно распределенной физической нагрузке.
        </VP>
      </VTipSmall>

      <VH3>Сон</VH3>
      <VP>
        Обязательным условием потери веса является небольшой дефицит калорий,
        который заставит ваш организм мобилизовать ваш собственный подкожный жир
        как источник энергии, что и приведет к потере веса. Но во первых нужно
        создать этот дефицит, путем нормализации рациона питания, во вторых
        обеспечить физическую активность.
      </VP>
      <VP>
        Такой режим для организма является стрессовым, поэтому очень важную роль
        играет восстановление. Самое активное восстановление происходит во время
        сна. Спать во время похудения жизненно важно в необходимом количестве.
        Суточный сон должен составлять от 8 часов. Но все конечно индивидуально,
        кому то чуть больше, кому то чуть меньше. Если за ночь столько спать не
        получается, старайтесь, по возможности, досыпать днем. Если вас
        постоянно клонит в сон, у вас дикая усталость и неохота что либо делать,
        то сна вам недостаточно.
      </VP>
      <VP>
        Если подвести под общий итог все сказанное выше, то залог вашего
        успешного похудения будет залучаться в правильной постановке питания,
        доставочной физической активности и правильном восстановлении.
      </VP>
      <VTipSmall>
        <VP>
          Соблюдайте все эти несложные правила и вы обязательно достигните
          желаемого.
        </VP>
      </VTipSmall>
    </div>
  </div>
</template>
<script>
import { VTipSmall } from '../../../components/'
export default {
  components: { VTipSmall }
}
</script>

<style scoped>
.list-total {
  margin-left: var(--space);
  list-style: circle;
}
.list-total li {
  margin-bottom: var(--space-third);
  color: var(--green-base);
  font-size: 18px;
  line-height: 1.25;
}

.common p {
  color: var(--grey-light3);
  line-height: 1.3;
  margin-bottom: var(--space-third);
  text-align: justify;
}
.common h3 {
  margin: var(--space) 0 var(--space-half) 0;
}

.common .tip > p {
  margin: 0;
}

.common .tip {
  margin-bottom: var(--space-half);
}
</style>
