<template>
  <div class="readme">
    <VPageHeading button level="3">
      Ограничения по здоровью
      <template v-slot:info>
        <VTipSmall>
          <VP>
            Обязательно для ознакомления!
          </VP>
        </VTipSmall>
      </template>
    </VPageHeading>
    <div>
      <VP>
        Ттренировки созданы с целью привести вас к цели, а именно укрепить
        здоровье, уменьшить ваш вес, улучшить качество вашего тела.
      </VP>
      <VP>
        Но для того, чтобы тренировки прошли максимально полезно и без ситуаций,
        предполагающих травмы, просим внимательно ознакомиться со всеми
        рекомендациями.
      </VP>
      <VH3>Особенности техники и отдыха между подходами при заболеваниях</VH3>
      <VP>
        При заболеваниях сердечно-сосудистой системы, при которых возможны
        умеренные физические нагрузки (аритмия, вегето-сосудистая дистония и
        др.), а также заболеваний кардиореспираторной системы (не тяжелые формы
        астмы и др.), следует внимательно следить за своим состоянием во время
        тренировки.
      </VP>
      <VTipSmall>
        <VP>
          Отдых между подходами распределяем таким образом, чтобы пульс не
          поднимался до высокого уровня.
        </VP>
      </VTipSmall>
      <VP>
        Так же следим за дыханием. Ни в коем случае не задерживаем дыхание во
        время упражнений, так же восстанавливаем его между подходами до
        нормальной частоты.
      </VP>
      <VP>
        Так же следим за дыханием. Ни в коем случае не задерживаем дыхание во
        время упражнений, так же восстанавливаем его между подходами до
        нормальной частоты.
      </VP>
      <VP>
        Если указанное количество повторов в подходе для вас слишком высокое (а
        высокое оно в том случае, если вы действительно не в силах его выполнить
        , а не из за того, что вам просто сложно), сбавляем количество повторов
        до приемлемого.
      </VP>
      <VP>
        Между подходами, во время отдыха не сидим и не лежим, иначе это может
        привести к ухудшению состояния. Правильный отдых выполняется в положении
        стоя, либо в ходьбе. Так пульс и дыхание восстановится правильнее и
        быстрее, без перепадов состояния.
      </VP>
      <VP>
        В среднем отдых между подходами 1 - 1.5 минуты. Но так как каждая новая
        тренировка постепенно станет сложнее, чем предыдущая, то отдых возможно
        увеличивать до 2.5 - 3 минут.
      </VP>

      <VTipSmall>
        <VP>
          Выполнять упражнения необходимо строго по технике, указанной на видео,
          либо по рекомендациям в тексте самой тренировки, если есть какие-то
          нюансы выполнения.
        </VP>
      </VTipSmall>
      <VP>
        При заболеваниях опорно-двигательной системы (грыжи, протрузии, травмы
        или заболевания суставов), при которых возможны физические нагрузки,
        большое внимание уделяем ощущениям в проблемной зоне.
      </VP>
      <VP>
        Если в позвоночнике есть грыжи или протрузии, то прыжки, подъемы ног
        лежа выполняем с особой осторожностью, ориентируясь на отсутствие
        сильного перенапряжения в проблемной области. Легкий дискомфорт будет,
        его не избежать, так как это одно из условий адаптации и укрепления
        организма. Но если боль становится ощутимой, постоянно усиливается, то
        упражнение, на котором состояние усугубляется исключеам на время. По
        истечению определенного промежутка времени, при котором неприятные
        ощущения проходят, возвращаем упражнение, но если боль с такой же
        интенсивностью возвращается, исключаем упражнение полностью.
      </VP>
      <VP>
        При проблемах в сутсавах очень аккуратно выполняем приседания, выпады и
        прыжки. Если все делать строго по технике, даже с больными суставам
        неприятных ощущений быть не должно, либо они будут минимальными.
      </VP>
      <VTipSmall>
        <VP>
          Некоторые упражнения, к которым идут комментарии в самих тренировках,
          выполняем сначала в неполную амплитуду, постепенно переходя в
          полноценное исполнение.
        </VP>
      </VTipSmall>
      <VP>
        Очень важную роль играет кардионагрузка, как в тренировках в
        спортзале(ходьба по беговой дорожке, на степпере, эллепсе или
        велотренажере), домашних тренировках(разогревающие упражнения, идущие
        перед разминкой) так и любая активность в быту (уборка, ходьба по улице,
        прогулки и др.)
      </VP>
      <VP>
        Главные преимущества кардиоупражнений, это увеличение вашей
        выносливости, сжигание лишних калорий, улучшение самочувствия, улучшение
        состояния опорно-двигательной системы.
      </VP>
      <VP>
        Но если вы не соблюдаете рекомендации по питанию, то ваши усилия
        приведут к улучшению здоровья и общего самочувствия, но без значительных
        потерь подкожного жира.
      </VP>
      <VP>
        75% вашего прогресса будет зависеть в первую очередь от питания, а
        остальные 25% от тренировок и полноценного сна.
      </VP>
      <VP color="var(--green-base)">
        Наберитесь терпения и идите полным ходом к вашему здоровью, красивой
        фигуре и уверенности в себе, а первые результаты спустя
        непродолжительный период вас особенно смотивируют!
      </VP>
    </div>
  </div>
</template>

<script>
import { VTipSmall } from '../../../components/'
export default {
  middleware: 'requireSub',
  components: { VTipSmall }
}
</script>
