<template>
  <div class="readme">
    <VPageHeading button>Углеводы</VPageHeading>
    <div>
      <VP>
        Углеводы – один из источников энергии, поступающих с пищей. Два типа
        перевариваемых углеводов, крахмал и сахар, содержатся почти в любой
        натуральной пище – от круп и фруктов до рыбы и молока. Углеводы обычно
        составляют основную часть нормального повседневного рациона.
      </VP>
      <VP>
        Сбалансированный рацион не обходится без клетчатки, поскольку она
        помогает выводить вредные вещества. Клетчатка также придает нашей пище
        «объем», что замедляет ее прохождение через кишечник и облегчает
        абсорбцию питательных веществ.
      </VP>

      <VP>
        Клетчатка содержится только в растительной пище, но, к примеру, при
        очистке зерна диетическая клетчатка часто удаляется. Отсюда следует, что
        белый рис и белая мука имеют малую питательную ценность, поскольку почти
        не содержат клетчатки. Ее главными источниками служат мука из цельного
        зерна (вернее, приготовленные из нее хлеб, макаронные изделия и зерновые
        завтраки), коричневый рис и большинство видов орехов. Овощи и фрукты
        отличаются по содержанию клетчатки; особенно много ее в шпинате, молодой
        зелени и сушеной фасоли.
      </VP>
      <img alt="Жиры" src="/images/tips/carbo1.png" />
      <img alt="Жиры2" src="/images/tips/carbo2.png" />
    </div>
  </div>
</template>
<script>
import VTipSmall from '../../../../components/ui/VTipSmall'
export default {
  middleware: 'requireSub',
  components: { VTipSmall }
}
</script>
