<template>
  <div class="readme">
    <VPageHeading button>Жиры</VPageHeading>
    <div>
      <VP>
        Так же, как углеводы, жиры являются источниками энергии. Их приток
        более-менее постоянен. Тем не менее, часть жиров после пищеварения
        откладывается в «кладовых» нашего организма – под кожей и вокруг таких
        жизненно важных органов, как сердце, печень и почки. Эти слои жира
        защищают нас от холода и предохраняют кости и внутренние органы от
        повреждений. Жиры растительного и животного происхождения имеют
        различный состав жирных кислот, определяющий их физические свойства и
        физиолого-биохимические эффекты.
      </VP>
      <VTipSmall>
        <VP color="var(--grey-light3)">
          Жирные кислоты подразделяются на два основных класса - насыщенные и
          ненасыщенные. Предпочтение стоит отдать ненасыщенным жирам.
        </VP>
      </VTipSmall>
      <img alt="Жиры" src="/images/tips/fats1.png" />
      <img alt="Жиры2" src="/images/tips/fats2.png" />
      <img alt="Жиры3" src="/images/tips/fats3.png" />
    </div>
  </div>
</template>
<script>
import VTipSmall from '../../../../components/ui/VTipSmall'
export default {
  components: { VTipSmall }
}
</script>
