<template>
  <div class="readme">
    <VPageHeading button>Вода</VPageHeading>
    <div>
      <VP>
        Вода не является питательным веществом, ее энергетическая ценность равна
        нулю, и все же это еще один ключевой фактор сбалансированного питания.
      </VP>
      <VP>
        Кроме поддержания состава тканей тела и обмена питательных веществ, вода
        выполняет еще одну жизненно необходимую функцию. Она выводит из
        организма токсичные отходы химических реакций прежде, чем они успеют
        принести вред.
      </VP>
      <VTipSmall>
        <VP color="var(--grey-light3)">
          Поэтому человеку требуется около полутора - трех литров воды в день.
        </VP>
      </VTipSmall>
      <VP>
        Конечно, это больше, чем мы выпиваем с чаем и кофе, но большая часть
        пищи также частично состоит из воды.
      </VP>
    </div>
  </div>
</template>
<script>
import VTipSmall from '../../../../components/ui/VTipSmall'
export default {
  components: { VTipSmall }
}
</script>
