<template>
  <div class="readme">
    <VPageHeading button>Марафон здоровья</VPageHeading>
    <div>
      <img alt="Эксперимент" src="/images/tips/marathon1.jpg" />
      <VCaption style="text-align: center">ЗОЖ-марафон. Укрепляем иммунитет за 45 дней!
      </VCaption>
      <VP>
        Пример многократно проверенного марафона на 1.5 месяца.
      </VP>
      <VP>
        Хочешь увидеть серии, как герои проходили этот же марафон и преобразили иммунитет и качество жизни?
      </VP>
      <VP>
        Смотри на Youtube проект <a href="https://youtube.com/playlist?list=PLHnq3G0kkZLdT-uK-MgvfpIrckPJOUZRm" target="_blank"><span style="color: var(--yellow-base)">«Эксперимент_Иммунитет»</span></a>!
      </VP>
      <VP>
        Марафон рассчитан на взрослых людей, без острых воспалительных заболеваний, желчных камней, тяжелых стадий
        заболеваний. Носит рекомендательный характер.
        Перед началом марафона проконсультируйтесь с врачом.
      </VP>

      <VH3>Правила марафона</VH3>
      <ol>
        <li>
          1. Ежедневно пить воду 7-8 стаканов. Сырую и чистую. Заведите «волшебную полторашку» и пишите на ней маркером
          число дня марафона. Пейте до еды. Выпивайте ее за день.
        </li>
        <li>
          2. Прогулка каждый день от 1,5-2 км и более. Попробуйте длинный вдох ( на несколько шагов 1 вдох) и такой же
          выдох. В идеале совместить с любыми тренажёрами (уличными) или турниками.
        </li>
        <li>
          3. Утром или вечером тянитесь. От простой растяжки до йоги. 15-20 минут
        </li>
        <li>
          4. Как можно больше сырых овощей и несладких фруктов. Ягоды. Орехи ограниченно в первой половине дня. Зелень.
          Словом, больше сырого!
        </li>
        <li>
          5. Возьмите за правило покупать на рыночке / ярмарке вместо магазина. Найдите производителей домашних
          эко-продуктов.
        </li>
        <li>
          6. Хотя бы 2 раза в месяц ходите в баню при температуре до 70-80 градусов. Найдите банную компанию!
        </li>
        <li>
          7. Контрастный душ по утрам ( постепенно разница температур все больше) + обтирание мокрым полотенцем (до
          розовой кожи). Лицо смазывайте кремом после обтирания.
        </li>
        <li>
          8. Попробуйте поиграть в такую игру - в любой проблеме ищите позитив. Продержитесь 1,5 месяца! Работает!
        </li>
        <li>
          9. Раз в 2 недели 36 часовое голодание. С вечера первого дня до утра 3го. Разгрузочный день. Выходите на
          салате с сырыми овощами. Это не голодание – это пищевая пауза.
        </li>
        <li>
          10. Физические упражнения 3 раза в неделю (приложение в помощь!).
        </li>
        <li>
          11. Пропиваем антипаразитарный травяной сбор. Обратитесь к фитотерапевту, либо поищите в Сети, с хорошими
          отзывами. Обычно сбора хватает на 1-1,5 месяца. Обратите внимание на ограничения с желчными камнями!
        </li>
        <li>
          12. Делаем дыхательную гимнастику по Виму Хофу, ежедневно (см. раздел выше).
        </li>
        <li>
          13. Пропейте месяц природные витамины или антиоксиданты. Рекомендуем продукцию компании Парафарм г. Пенза
          «Апитонус» и «Дегидроквертицин» (всегда можно найти на apteka.ru).
        </li>
        <li>
          14. Замасливание. 2 недели пьем натощак домашнее масло холодного отжима (например, льняное) по столовой ложке.
          Добавьте несколько капель лимона. После двух недель приема – перерыв неделя (итого пьем 4 недели за 1,5
          месяца).
        </li>
        <li>15. Дважды в неделю принимать содовые ванные. Они крайне полезны для ощелачивания крови. Сомневаетесь, что
          кровь кислая? Если вы употребляете много мучного, сладкого, кофе, мяса, фастфудов (достаточно одного из этих
          пунктов), не сомневайтесь - организм "кислый".
          <br>Сомневаетесь? Сдайте анализы на PH-баланс.
          <br>Содовые ванны - легкая процедура для организма. Просто высыпаете 1/2 пачки соды в ванную и кайфуете минут
          20 при температуре 40-45 градусов.
        </li>
        <li>
          16. Помните, что дышит все тело. Одевайте минимум одежды дома, гуляйте на солнце, подставляя ему лицо и кисти
          рук. Проветривайте перед сном. Как можно больше кислорода в жизнь!
        </li>
      </ol>

      <VH3>Исключить или заменить</VH3>
      <ol>
        <li>
          1. Исключите алкоголь и сигареты.
        </li>
        <li>
          2. Исключите мучное. Хлеб покупайте бездрожжевой. Он полезен и вкусен. Белая мука высшего сорта (химически
          выращенная, отбеленная, лишённая всего полезного) вас уничтожает. Мучное - это ещё и макароны.
        </li>
        <li>
          3. Меньше старайтесь жарить и варить. Пеките, в крайнем случае, тушите.<br>
          Если варите - не доваривайте. Не ешьте вареное на ночь. Помните - больше сырого. Ужин - салат с белком +
          отруби. Привыкните каждый вечер есть горсть отрубей
        </li>
        <li>
          4. Не уничтожайте себя фастфудами, полуфабрикатами, готовой едой, консервами, газировкой, едой из кафе. На 1,5
          месяца для начала! После - не захочется.
        </li>
        <li>
          5. Замените молочку кисломолочкой. Творог кушайте ограниченно. Кисломолочку полезно принимать вечером.
        </li>
        <li>
          6. Разделите 3 приема пищи на 5 приемов.
        </li>
        <li>
          7. Вот сейчас, когда читаете, попейте чистую воду. Пейте почаще!
        </li>
        <li>
          8. Гарниры используйте разнообразные. Попробуйте стручковую фасоль, нут, маш, чечевицу, кукурузную, пшеничную,
          овсяную кашу, гречку. Овощей рекомендуем больше из погреба "бабушкиных" и с грядки - репа, тыква, редька,
          квашеная капуста, топинамбур, редис, капуста, морковь, лук, свекла, кабачки и баклажаны. Рецептов в Сети очень
          много.
        </li>
        <li>
          9. Не кушайте позже 19-30. Спать ложитесь в 22ч.
        </li>
        <li>
          10. На 1.5 месяца забудьте про кофе, мороженое. Замените кофе травяным чаем! Мороженое – йогуртом без добавок
          с ягодами (заморозка).
        </li>
        <li>
          11. Навсегда забудьте о дешёвом чае в пакетиках. Есть множество прекрасных травяных чаев, шиповник, имбирь,
          масала и пр. Ими замените кофе. Попробуйте прекрасные китайские чаи.
        </li>
        <li>
          12. Правильная последовательность приема пищи такая - фрукты за час до еды, вода минимум за 30 минут. Чай.
          Первое. Второе блюдо. Смысла в первых блюдах особо нет, но если очень хочется, то можно с слегка недоваренными
          овощами.
        </li>
      </ol>
      <VP>Все просто. Нет никаких секретов! Будьте здоровы - самое время перейти на сторону ЗОЖ!</VP>

    </div>
  </div>
</template>
<script>
import VTipSmall from '../../components/ui/VTipSmall'

export default {
  middleware: 'requireSub',
  components: { VTipSmall }
}
</script>

<style scoped>
ol li {
  color: var(--white-trans1);
  font-size: var(--p-fs);
  line-height: 1.2;
  margin-bottom: var(--space-half);
}
</style>
