<template>
  <div class="readme">
    <VPageHeading button>Дыхательная гимнастика</VPageHeading>
    <div>
      <VP>
        Дыхательная гимнастика – прямой путь к здоровью. За 5-7 минут в день можно насытить клетки кислородом и
        восстановить альвеолы легких. Мы рекомендуем занятия по авторской системе знаменитого Вима Хофа.
      </VP>
      <VP>
        Известный как «Ледяной человек», он неоднократно попадал в книгу рекордов Гиннесса, демонстрируя свою
        способность выдерживать сверхнизкие температуры и задерживая дыхание на несколько минут.
      </VP>
      <VP>
        Однако даже домохозяйке, которой далеко до рекордов, будет очень полезен «Метод Вима Хофа». В лабораторных
        условиях доказано, что стать выносливым и стрессоустойчивым человеком может каждый.
      </VP>
      <img alt="Жиры" src="/images/tips/respiratory1.png" />
      <VP>
        Метод Вима Хофа заключается в проведении ежедневной дыхательной гимнастики, занятий спорта и принятия холодного
        душа.
      </VP>
      <VP>
        Благодаря его дыхательной гимнастике можно насытить организм кислородом, улучшить работу легких, снизить стресс,
        улучшить циркуляцию крови, усилить сопротивляемость организма к вирусам и инфекциям, восстановить работу легких
        после коронавирусной инфекции «Ковид-19».
      </VP>
      <VP>
        Гимнастика снижает воспалительные процессы в организме и улучшает работу иммунной системы, а также снижает риски
        депрессий.
      </VP>
      <VP>
        Применяя дыхательную гимнастику на себе, мы ежедневно убеждаемся в ее эффективности.
      </VP>
      <VP>
        Это как перезагрузка компьютера. Подышали 5 минут – и усталости/стресса как будто не бывало.
      </VP>
      <VP>
        Рекомендуется дышать 1-2 раза в день. Гимнастика очень проста. Побочные эффекты отсутствуют. При сильном
        головокружении переходите к задержке дыхания (см. видеоинструкцию). Занятия дыхательной гимнастикой не требуют
        специальных навыков и носят рекомендательный характер.
      </VP>

      <iframe
        id="ytplayer2"
        type="text/html"
        allowfullscreen="allowfullscreen"
        width="100%"
        height="340"
        :src="
        'https://www.youtube.com/embed/mrca9drYbTk?modestbranding=1&showinfo=0&rel=0&loop=1'
      "
        frameborder="0"
      ></iframe>
      <VCaption style="text-align: center; margin: var(--space-third) 0;">Видеоинструкция: дыхание по Виму Хофу. Архив Армии похудения</VCaption>
    </div>
  </div>
</template>
<script>
import VTipSmall from '../../components/ui/VTipSmall'

export default {
  middleware: 'requireSub',
  components: { VTipSmall }
}
</script>
