<template>
  <div class="readme">
    <VPageHeading button>Советы для ЗОЖ</VPageHeading>
    <VH3>Советы по Здоровому Образу Жизни</VH3>
    <div>
      <VP>
        Приведены общие рекомендации. При наличии серьезных патологий и заболеваний советуйтесь с лечащим врачом.
      </VP>
      <VP>
        Армия рекомендует устраивать оздоровительные месячные марафоны с ежедневным самоконтролем.
      </VP>
      <VH3>Правила здоровья</VH3>

      <ol>
        <li>
          1. Ежедневно пить воду 7-8 стаканов. Сырую и чистую. Заведите «волшебную полторашку и пишите на ней маркером
          число дня марафона. Пейте до еды. Выпивайте бутылку за день.
        </li>
        <li>
          2. Прогулка каждый день от 1,5-2 км и более. Попробуйте длинный вдох (на несколько шагов 1 вдох) и такой же
          выдох. В идеале совместить пользование приложением ( Центр тренировок) с любыми тренажёрами (домашними /
          уличными), либо просто работать с собственным весом.
        </li>
        <li>
          3. Утром или вечером тянитесь. Аккуратно, постепенно. Полезна йога для начинающих, достаточно 15 минут.
        </li>
        <li>
          4. Питайтесь разнообразно. Принимайте в пищу можно больше сырых овощей и несладких фруктов (не пренебрегайте
          меню Армии в Центре питания). Приветствуются ягоды, зелень, орехи ограниченно.
        </li>
        <li>
          5. Возьмите за правило покупать на рынке / ярмарке вместо магазина.
        </li>
        <li>
          6. Хотя бы 2 раза в месяц ходите в баню при температуре до 70-80 градусов. Найдите банную компанию в чате
          приложения, либо соцсетях!
        </li>
        <li>
          7. Принимайте контрастный душ по утрам ( постепенно разница температур увеличивается) – см. видео ниже.
        </li>
        <li>
          8. Попробуйте поиграть в такую игру - в любой проблеме ищите позитив. Работает!
        </li>
        <li>
          9. Раз в 2 недели устраивайте 30-часовую пищевую паузу. Это безопасно, но пейте только чистую сырую воду.
        </li>
        <li>
          10. Позволяйте себе хотя бы иногда ничего не делать. Вообще ничего.
        </li>
        <li>
          11. Для профилактики коронавирусной инфекции COVID-19, либо уменьшения ее последствий занимайтесь дыхательной
          гимнастикой, проводите время на солнце, подставляя лицо и кисти рук солнечным лучам.
        </li>
        <li>
          12. Ничего не бойтесь. Начните с малого и идите к своей цели. Помните – работает только система.
        </li>
      </ol>
      <VTipSmall>
        <VP color="var(--grey-light3)">
          Наш подход высоко оценил самый известный врач-диетолог в России, профессор Алексей Владимирович Ковальков.
        </VP>
      </VTipSmall>
      <img alt="Жиры" src="/images/tips/immune_tips1.jpg" />

      <VH3>Контрастный душ</VH3>
      <VP>Универсальное лекарство для здоровья капилляров. Капилляры – второе сердце! Контрастный душ поможет вам
        похудеть и помолодеть на несколько нет, восстановит терморегуляцию, даст тонус кожи и мыщц.
      </VP>
      <VH3>Ваше здоровье в Ваших руках!</VH3>

    </div>
  </div>
</template>
<script>
import VTipSmall from '../../components/ui/VTipSmall'

export default {
  middleware: 'requireSub',
  components: { VTipSmall }
}
</script>

<style scoped>
ol li {
  color: var(--white-trans1);
  font-size: var(--p-fs);
  line-height: 1.2;
  margin-bottom: var(--space-half);
}
</style>
