<template>
  <div class="readme">
    <VPageHeading level="3" button>Введение по персональному меню</VPageHeading>
    <div>
      <VP>
        Здравия желаю! Перед началом - обязательно прочитайте
        <span
          @click="$router.push('/food/tips/nutrients')"
          style="color: var(--yellow-base)"
        >
          информацию о питательных веществах.
        </span>
        Если уже сделали это - приступим!
      </VP>
      <VP>
        Меню составлено на основе самых современных аспектов диетологии.
        Доверяйте ему! Блюда из указанных продуктов можно делать довольно
        разнообразные. Пределу творчеству предела нет! Но проявляйте дисциплину.
        Ведь именно питание – залог успеха!
      </VP>
      <VP>
        Я, врач-диетолог Черниенкова Арина, максимально доходчиво подготовила
        данный материал для Вас!
      </VP>

      <VP>
        Сбалансированность питания подразумевает сбалансированность между собой
        различных питательных веществ, например, пропорциональность между трёмя
        важными энергоносителями (углевод, жир, белок). А внутри белка должен
        быть баланс между необходимыми аминокислотами; баланс между насыщенными
        и ненасыщенными жирными кислотами; баланс между углеводами и пищевыми
        волокнами; баланс между кислотообразующей и щелочеобразующей пищей;
        баланс между продуктами животного и растительного происхождения и т.д.
        Кроме того сбалансированное питание должно подкрепляться физическими
        упражнениями.
      </VP>
      <VH3>Продукты, которые необходимо исключить на снижении веса</VH3>
      <ul class="readme__list">
        <li>Сахар и все его виды (мед, сиропы, фруктоза, патока)</li>
        <li>Мука из злаков, крахмал</li>
        <li>Манка, белый рис</li>
        <li>Майонез, кетчуп</li>
        <li>Колбаса и сосиски</li>
        <li>Трансжиры</li>
        <li>Жирное мясо (свинина, баранина, утка)</li>
        <li>Молочные продукты высокой жирности (сметана, сыры)</li>
      </ul>

      <VH3>Продукты, которые следует ограничить на снижении веса</VH3>
      <ul class="readme__list">
        <li>Сладкие фрукты</li>
        <li>Бананы</li>
        <li>Картофель, макароны</li>
        <li>Приготовленные тыква, свекла</li>
        <li>Сухофрукты</li>
      </ul>

      <VP>
        Уважаемый курсант Армии безопасного похудения. В
        <span
          @click="$router.push('/food/personal')"
          style="color: var(--yellow-base)"
        >
          разделе персонального меню
        </span>
        у вас есть программа Правильного Питания, расчитанная на снижение веса.
        Позвольте познакомить вас с тем, что она из себя представляет.
      </VP>

      <VP>
        Продукты и их соотношение подобраны таким образом, что вес будет
        снижаться постепенно, не нанося вреда внутренним органам и системам. В
        том числе, это позволит значительно снизить риск возврата килограммов,
        поскольку при резком снижении веса организм попадает в «состоянии
        войны», у него начинается острая нехватка ресурсов. В связи с этим, при
        первой же возможности мозг отдаст команду распределять все поступающие
        вещества в свои депо, на случай, если подобная ситуация повторится.
        Основное депо быстрого и долгосрочного хранения энергоресурсов - это
        жировая ткань. К сожалению, подобные физиологические моменты проходят
        без осознанного контроля, поэтому необходимо следить за тем, чтобы
        потеря веса составляла, в среднем, не более 3 - 4% в месяц от
        изначального веса.
      </VP>

      <VP>
        Помимо этого, не рекомендуется урезать какой-либо макроэлемент больше,
        чем позволяют стандарты, поскольку, например, резкое снижение жиров
        может привести к нарушениям в гормональном фоне, резкое снижение белков
        - к распаду мышечных волокон, наконец, большое снижение углеводов может
        привести к нехватке энергетических ресурсов и кетоацидозу.
      </VP>

      <VH3>Термообработка продуктов</VH3>

      <ul class="readme__list list--ol">
        <li>Варка на пару</li>
        <li>Тушение</li>
        <li>Запекание</li>
        <li>Отваривание</li>
        <li>Обжарка без масла</li>
      </ul>

      <VTipSmall>
        <VP color="var(--grey-light3)">
          Вышеперечисленные способы термической обработки продуктов представлены
          в порядке снижения их пользы. То есть, в первую очередь, стоит отдать
          предпочтение варке на пару или тушению. И максимально при этом
          исключить обжаривание продуктов.
        </VP>
      </VTipSmall>

      <VP>
        В любой прием пищи вы можете добавлять зелень в неограниченном
        количестве, специи.
      </VP>
      <VP>
        Сладкие блюда можно разнообразить ванилью, мускатным орехом, корицей,
        кокосовой стружкой, какао без сахара (нпрм. Золотой ярлык), сах.замом.
      </VP>
      <VP>
        Пробуйте находить время и подавать готовое блюдо интересно: на красивой
        посуде, аккуратно нарезанное, украшенное зеленью. Подача блюда может
        значительно усилить аппетит и желание съесть даже не самый любимый вами
        продукт.
      </VP>
      <VP>
        Cпособ приготовления продукта не указан, поскольку вы можете выбирать
        сами, в каком виде хотите его съесть.
      </VP>

      <VH3>Взаимозаменяемые продукты</VH3>

      <ul class="readme__list">
        <li>
          Крупы (гречка, овсянка, рис (нешлифованный, дикий, бурый, Рубин),
          перловка, пшено, кукурузная крупа, макароны (их рекомендуется
          ограничивать), булгур.
        </li>
        <li>Бобовые (чечевица, фасоль, горох, маш, нут)</li>
        <li>Рыба (треска, судак, минтай, скумбрия, семейство лососевых)</li>
        <li>
          Мясо/птица/субпродукты (говядина, курица, индейка/желудки, сердечки,
          печень)
        </li>
        <li>
          Масла (оливковое, подсолнечное нерафинированное, кокосовое, топленое)
        </li>
        <li>
          Орехи/семена (миндаль, фундук, грецкий орех, кедровые орехи, семена
          тыквы, подсолнечника, кунжутные)
        </li>
        <li>
          Овощи (цв.капуста/брокколи, помидоры, огурцы, болг.перец, сельдерей,
          морковь, лук, кабачки, баклажаны, зеленый горох/стручковая фасоль)
        </li>
      </ul>

      <VH3>Основные принципы меню</VH3>

      <ul class="readme__list list--ol">
        <li>
          Максимальное снижение в рационе простых углеводов (все то, что
          содержит сахар, муку, крахмал).
        </li>
        <li>
          Соблюдение соотношения растительных и животных жиров в соотношении
          60/40.
        </li>
        <li>
          Наличие в каждом из основных приемов пищи всех основных
          макронутриентов: белков, жиров и углеводов.
        </li>
        <li>
          Исключение на программе снижения веса составляет ужин: в вечернее
          время из углеводов допустимы только овощи (при переходе на поддержание
          веса, если есть достаточный расход энергии, медленные углеводы (крупы)
          в небольшом количестве включаются и в ужин).
        </li>
        <li>
          Перекус проходит не позднее 16.00 - 17.00 часов, в зависимости от
          времени отхода ко сну.
        </li>
        <li>Ужин не позднее, чем за 2 - 3 часа до сна.</li>
        <li>
          Необходимо выпивать ежедневно воду в достаточном количестве (из
          расчета примерно 30 мл./кг веса в сутки). Все, что не вода - еда!
        </li>
        <li>
          ОБЯЗАТЕЛЬНО завтракать. Это основной прием пищи, позволяющий
          максимально эффективно расходовать полученную энергию потом в течение
          дня.
        </li>
        <li>
          Сахар допустимо заменить на сахарозаменитель, безвредный,
          «безуглеводный». Например, Фитпарад 7 или Фитпарад 10.
        </li>
      </ul>

      <VP>
        И наконец, я хочу вас уверить, что все в ваших руках. Ваши вес и
        здоровье зависят только от собственных устремлений, ваших силы воли
        желания. Здоровье - это то, что не получается купить ни за какие деньги.
        Оно создается каждый день вашими стараниями и успехами в правильном
        питании, в спорте, в крепком сне, в позитивных эмоциях. Здоровье - это
        ваше будущее.
      </VP>
      <VP>
        Желаю каждому из вас достижения максимальных результатов, интересных и
        радостных событий на проекте и, конечно же, крепкого здоровья!
      </VP>
      <VP>
        Поздравляю вас с нахождением в рядах Армии фитнеса и здоровья! С
        уважением, диетолог проекта, Черниенкова Арина.
      </VP>
    </div>
  </div>
</template>
<script>
import { VTipSmall } from '../../../components/'
export default {
  components: { VTipSmall },
  middleware: 'minPlan_1'
}
</script>

<style scoped>
.readme__list li {
  color: var(--grey-light3);
}

.list--ol {
  list-style: decimal;
}
</style>
