<template>
  <div class="readme">
    <VPageHeading button>Помощник похудения</VPageHeading>
    <div>
      <img alt="Жиры" src="/images/tips/kilolight.jpg" />
      <VH3>Армия рекомендует!</VH3>

      <VP>
        Кило-лайт. Натуральный комплекс для похудения, который борется с лишним весом тремя разными способами. Состоит
        из 3х банок - "Утро", "День", "Вечер".
      </VP>

      <VP>Это конечно же не волшебная таблетка, но надежный помощник при похудении. Разработчики учли все нюансы
        снижения веса и пришли к следующим простым выводам:
      </VP>
      <ul class="readme__list">
        <li>При похудении не хватает энергии, а при этом, напротив, она нужна для движения</li>
        <li>Худеющих (как и просто полных людей) постоянно тянет на сладкое и перекусы</li>
        <li>При снижении веса из-за стресса организма люди перестают спокойно спать</li>
        <li>Рука об руку с резким похудением идут побочные эффекты: варикоз, целлюлит и даже остеохандроз, вызванные
          слабостью соединительной ткани
        </li>
      </ul>
      <VP>Решению всех этих проблем способствует комплекс из капсул «Утро», «День», «Вечер» - «Кило-лайт».</VP>

      <VP>Утренний и дневной препараты содержат минералы и аминокислоты, регулирующие центры насыщения организма, для
        того, чтобы человека меньше тянуло к пище. Вечерний прием Kilo-Light вечер (Кило-Лайт вечер) будет
        способствовать дополнительному сжиганию жира во время ночного сна. Для максимального эффекта рекомендуется
        приобретать именно полный комплект.
        Основа продукта - корни лекарственных трав и продукты пчеловодства, а также L-карнитин. НЕ ЯВЛЯЕТСЯ
        ЛЕКАРСТВЕННЫМ СРЕДСТВОМ.
      </VP>

      <VP>Производитель комплекса - ООО "Парафарм", производство биологически активных добавок с 1995 года, резидент
        "Сколково", самое инновационное предприятие Пензенской области в направлении экспорта. Продукция поставляется по
        всей России и в 8 стран мира. Сырье (лекарственные травы) выращивается компанией в экологически чистом
        Камешкирском районе Пензенской области.
        Все «волшебные таблетки для похудения» - это обман. Настоящий продукт – это помощник при похудении. Но большая
        часть результата зависит именно от вас!
        Узнать историю снижения веса на 100кг Генерала Армии, а также заказать «кило-лайт» можно на
        <a
          href="http://www.kilolight.ru/" target="_blank">
          <span style="color: var(--yellow-base)">
            www.kilolight.ru
        </span>
        </a>
      </VP>

      <iframe
        id="ytplayer2"
        type="text/html"
        allowfullscreen="allowfullscreen"
        width="100%"
        height="340"
        :src="
        'https://www.youtube.com/embed/8f7STEq5AnM?modestbranding=1&showinfo=0&rel=0&loop=1'
      "
        frameborder="0"
      ></iframe>
    </div>
  </div>
</template>
<script>
import { VTipSmall } from '../../../components/'

export default {
  components: { VTipSmall },
  middleware: ['requireSub', 'minPlan_1']
}
</script>

<style scoped>
.readme__list li {
  color: var(--grey-light3);
}

.list--ol {
  list-style: decimal;
}
</style>
