<template>
  <div>
    <VPageHeading>Центр питания</VPageHeading>
    <CategoryItem
      v-for="(category, index) in cats"
      :key="category.id"
      :category="category"
      :svgWidth="index === 0 && 50"
    ></CategoryItem>
    <div class="tutor">
      <VPageHeading level="3">Для вас несет службу</VPageHeading>
      <div class="tutor__info">
        <img
          class="tutor__info__avatar"
          src="/images/avatars/dietolog.jpg"
          alt="Аватарка тренера"
        />
        <div>
          <VP class="tutor__info__title">
            Черниенкова Арина
          </VP>
          <VP color="var(--grey-light3)">
            Врач-диетолог, высшее медицинское образование, стаж работы 4 года.
          </VP>
          <VP
            color="var(--grey-light3)"
            v-if="$store.getters['user/GET_USER'].plan_id > 1"
          >
            Чат со мной можно найти в разделе
            <span
              @click="$router.push('/messages')"
              style="color: var(--yellow-base)"
            >
              "сообщения"
            </span>
          </VP>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import CategoryItem from '../../components/pages/workout/index/CategoryItem'
export default {
  middleware: 'requireSub',
  components: { CategoryItem },
  data() {
    return {
      categories: [
        {
          id: 0,
          title: 'Персональное меню',
          url: '/food/personal',
          svg: `<svg width="49" height="59" viewBox="0 0 429 512" xmlns="http://www.w3.org/2000/svg"><path d="M135.7 380.7a4.3 4.3 0 01-4 2.3c-1.3 0-2.8-.5-3.8-2.3l-10.3-19.4v39.4c0 2.4-3 3.7-5.9 3.7-3 0-5.8-1.3-5.8-3.7v-56.2c0-4.3 2.9-5.9 5.8-5.9 4.3 0 6.2 1 9.1 6.2l11 20.2 11.1-20.2c3-5.3 5-6.2 9.2-6.2 3 0 5.8 1.6 5.8 5.9v56.2c0 2.4-3 3.7-5.8 3.7-3 0-5.8-1.3-5.8-3.7V362l-10.6 18.7zm54.8-13.8H204c2.4 0 3.7 2.2 3.7 4.6 0 2.1-1.1 4.5-3.7 4.5h-13.6v18.1h25.4c2.4 0 3.7 2.4 3.7 5.2 0 2.4-1.2 5-3.7 5h-32c-2.6 0-5.1-1.2-5.1-3.6v-58.4c0-2.4 2.5-3.7 5.1-3.7h32c2.5 0 3.7 2.6 3.7 5 0 2.9-1.3 5.3-3.7 5.3h-25.4v18zm77 33.8l-19.3-36.2v36.2c0 2.4-3 3.7-5.9 3.7-3 0-5.8-1.3-5.8-3.7v-58.4c0-2.5 2.9-3.7 5.8-3.7 4.3 0 6 1 8.8 6.2l17.3 33.6v-36.2c0-2.5 2.9-3.6 5.9-3.6 2.8 0 5.8 1.1 5.8 3.6v58.5c0 2.4-3 3.7-5.8 3.7s-5.3-1-6.8-3.7zm64.6-58.5c0-2.5 3-3.6 5.9-3.6 2.9 0 5.8 1.1 5.8 3.6v42.1c0 15-9.5 20.6-21.5 20.6-12.2 0-21.6-5.6-21.6-20.6v-42c0-2.6 2.9-3.7 5.8-3.7s5.9 1.1 5.9 3.6v42.1c0 7 3.7 10.3 9.9 10.3s9.8-3.3 9.8-10.3v-42zm23.2 79.9h-42.8a7.6 7.6 0 100 15.2h42.8a7.6 7.6 0 100-15.2zm-78.1 0h-173a7.6 7.6 0 000 15.2h173a7.6 7.6 0 100-15.2zm78.1-115.9h-251a7.6 7.6 0 000 15.2h251a7.6 7.6 0 100-15.2zm-4.3-94.1h-7.3a114.4 114.4 0 00-91.1-105.5l1.4-14a16.2 16.2 0 00-16.1-18h-16.2a16.3 16.3 0 00-16.2 18l1.5 14a114.3 114.3 0 00-91.1 105.5h-7.4c-6.5 0-11.8 5.3-11.8 11.8v15.7c0 6.5 5.3 11.8 11.8 11.8H351c6.5 0 11.8-5.3 11.8-11.8V224c0-6.5-5.2-11.8-11.8-11.8zM221 90.2c.2-.2.4-.3.8-.3H238c.3 0 .5 0 .8.3.2.2.3.5.2.8l-1.4 13.6a115.4 115.4 0 00-15.5 0L220.6 91c0-.3 0-.6.3-.8zm126.8 146H111.9v-8.9h32a7.6 7.6 0 100-15.2H131a99 99 0 01197.4 0H179.2a7.6 7.6 0 100 15.2h168.5v9z" fill="#000"/><path d="M409.5 0H50a19.4 19.4 0 00-19.3 19.3V33h-7a23.7 23.7 0 000 47.3h7v32.5h-7a23.7 23.7 0 000 47.2h7v32.5h-7a23.7 23.7 0 000 47.3h7v32.4h-7a23.7 23.7 0 000 47.3h7V352h-7a23.7 23.7 0 000 47.2h7v32.5h-7a23.7 23.7 0 000 47.3h7v13.7c0 10.6 8.7 19.3 19.3 19.3h359.5c10.6 0 19.3-8.7 19.3-19.3V19.3c0-10.6-8.7-19.3-19.3-19.3zM30.7 65.1h-7a8.5 8.5 0 010-16.9h7v17zm0 79.8h-7a8.5 8.5 0 010-17h7v17zm0 79.7h-7a8.5 8.5 0 010-17h7v17zm0 79.7h-7a8.5 8.5 0 010-16.9h7v17zm0 79.7h-7a8.5 8.5 0 010-16.9h7v17zm0 79.8h-7a8.5 8.5 0 010-17h7v17zm383 28.9c0 2.3-2 4.1-4.2 4.1H50a4.2 4.2 0 01-4.1-4.1V19.3c0-2.3 1.9-4.1 4.1-4.1h359.5a4 4 0 014.1 4.1v473.4z" fill="#000"/></svg>`,
          minPlan: 1
        },
        {
          id: 1,
          title: 'Советы',
          url: '/food/tips',
          svg: `<svg  width="58" height="58" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M39.195 36.137c-.625 0-1.133.507-1.133 1.133v7.816a5.67 5.67 0 01-5.664 5.664h-12.23c-.626 0-1.133.507-1.133 1.132l-.002 2.252-2.704-2.703a1.133 1.133 0 00-1.038-.681H7.93a5.67 5.67 0 01-5.664-5.664V27.64a5.67 5.67 0 015.664-5.664H19.37a1.133 1.133 0 000-2.266H7.93C3.557 19.71 0 23.268 0 27.64v17.445c0 4.372 3.557 7.93 7.93 7.93h6.78l4.653 4.652a1.132 1.132 0 001.934-.8l.003-3.852h11.098c4.373 0 7.93-3.558 7.93-7.93V37.27c0-.626-.507-1.133-1.133-1.133z" fill="#000"/><path d="M41.535 0h-2.867C29.59 0 22.203 7.386 22.203 16.465S29.59 32.93 38.668 32.93h2.867c1.417 0 2.82-.18 4.179-.536l4.235 4.233a1.133 1.133 0 001.934-.801v-6.554a16.623 16.623 0 004.328-5.336A16.288 16.288 0 0058 16.465C58 7.386 50.614 0 41.535 0zm8.533 27.814c-.284.215-.45.55-.45.905v4.373l-2.773-2.77a1.133 1.133 0 00-1.133-.282 14.203 14.203 0 01-4.177.624h-2.867c-7.83 0-14.2-6.37-14.2-14.199 0-7.83 6.37-14.2 14.2-14.2h2.867c7.83 0 14.2 6.37 14.2 14.2 0 4.5-2.066 8.638-5.667 11.35z" fill="#000"/><path d="M45.203 12.395a4.807 4.807 0 00-4.447-4.446 4.76 4.76 0 00-3.61 1.278 4.813 4.813 0 00-1.523 3.506 1.133 1.133 0 102.265 0c0-.709.286-1.366.805-1.85a2.532 2.532 0 014.25 1.668 2.52 2.52 0 01-1.968 2.651 2.144 2.144 0 00-1.69 2.102v2.721a1.133 1.133 0 002.266 0v-2.63a4.771 4.771 0 003.652-5zM41.22 23.705a1.141 1.141 0 00-.801-.332c-.298 0-.59.121-.801.332-.21.21-.332.503-.332.801 0 .3.121.591.332.802.21.21.503.331.8.331.299 0 .591-.12.802-.33.21-.213.332-.504.332-.803 0-.298-.122-.59-.332-.8zM31.152 35.117H7.25a1.133 1.133 0 000 2.266h23.902a1.133 1.133 0 100-2.266zM31.953 41.793a1.14 1.14 0 00-.8-.332c-.299 0-.59.121-.802.332a1.14 1.14 0 00-.331.8c0 .299.12.59.331.802.211.21.503.332.801.332.298 0 .59-.122.801-.332.21-.211.332-.502.332-.801 0-.298-.121-.59-.332-.801zM26.697 41.46H7.25a1.133 1.133 0 000 2.267h19.447a1.133 1.133 0 000-2.266zM23.79 28.773H7.25a1.133 1.133 0 000 2.266h16.54a1.133 1.133 0 000-2.266z" fill="#000"/></svg>`
        }
      ]
    }
  },
  computed: {
    cats() {
      const curPlan = this.$store.getters['user/GET_USER'].plan_id
      const planIsOk = this.categories.filter(
        item => !item.minPlan || item.minPlan <= curPlan
      )
      const planIsntOk = this.categories
        .filter(item => item.minPlan > curPlan)
        .map(item => {
          return { ...item, planFailed: true }
        })

      return [...planIsOk, ...planIsntOk]
    }
  }
}
</script>

<style scoped>
.tutor {
  margin-top: var(--space);
}
.tutor__info {
  display: flex;
}

.tutor__info > div {
  margin-left: var(--space);
}

.tutor__info__title {
  color: var(--yellow-base);
  text-shadow: 0 0 40px #eff62144;
  font-size: 20px;
  margin-bottom: var(--space-half);
}

.tutor__info__avatar {
  min-width: 118px;
  max-width: 40%;
  border: 2px solid var(--yellow-base);
  border-radius: 3px;
  box-shadow: 0 -5px 40px -10px #eff62133;
}
</style>
